cmsis-svd/cmsis-svd/data/Atmel/ATSAMD51J18A.svd
            <register>
               <name>SEESTAT</name>
               <description>SmartEEPROM Status Register</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ASEES</name>
                     <description>Active SmartEEPROM Sector</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOAD</name>
                     <description>Page Buffer Loaded</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>Busy</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCK</name>
                     <description>SmartEEPROM Write Access Is Locked</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLOCK</name>
                     <description>SmartEEPROM Write Access To Register Address Space Is Locked</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SBLK</name>
                     <description>Blocks Number In a Sector</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PSZ</name>
                     <description>SmartEEPROM Page Size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>OSCCTRL</name>
         <version>U24011.0.0</version>
         <description>Oscillators Control</description>
         <groupName>OSCCTRL</groupName>
         <prependToName>OSCCTRL_</prependToName>
         <baseAddress>0x40001000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x58</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>OSCCTRL_XOSC0</name>
            <value>2</value>
         </interrupt>
         <interrupt>
            <name>OSCCTRL_XOSC1</name>
            <value>3</value>
         </interrupt>
         <interrupt>
            <name>OSCCTRL_DFLL</name>
            <value>4</value>
         </interrupt>
         <interrupt>
            <name>OSCCTRL_DPLL0</name>
            <value>5</value>
         </interrupt>
         <interrupt>
            <name>OSCCTRL_DPLL1</name>
            <value>6</value>
         </interrupt>
         <registers>
            <register>
               <name>EVCTRL</name>
               <description>Event Control</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>CFDEO0</name>
                     <description>Clock 0 Failure Detector Event Output Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFDEO1</name>
                     <description>Clock 1 Failure Detector Event Output Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSCRDY0</name>
                     <description>XOSC 0 Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSCRDY1</name>
                     <description>XOSC 1 Ready Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSCFAIL0</name>
                     <description>XOSC 0 Clock Failure Detector Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSCFAIL1</name>
                     <description>XOSC 1 Clock Failure Detector Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRDY</name>
                     <description>DFLL Ready Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLOOB</name>
                     <description>DFLL Out Of Bounds Interrupt Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKF</name>
                     <description>DFLL Lock Fine Interrupt Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKC</name>
                     <description>DFLL Lock Coarse Interrupt Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRCS</name>
                     <description>DFLL Reference Clock Stopped Interrupt Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL0LCKR</name>
                     <description>DPLL0 Lock Rise Interrupt Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL0LCKF</name>
                     <description>DPLL0 Lock Fall Interrupt Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL0LTO</name>
                     <description>DPLL0 Lock Timeout Interrupt Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL0LDRTO</name>
                     <description>DPLL0 Loop Divider Ratio Update Complete Interrupt Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL1LCKR</name>
                     <description>DPLL1 Lock Rise Interrupt Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL1LCKF</name>
                     <description>DPLL1 Lock Fall Interrupt Enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL1LTO</name>
                     <description>DPLL1 Lock Timeout Interrupt Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL1LDRTO</name>
                     <description>DPLL1 Loop Divider Ratio Update Complete Interrupt Enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSCRDY0</name>
                     <description>XOSC 0 Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSCRDY1</name>
                     <description>XOSC 1 Ready Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSCFAIL0</name>
                     <description>XOSC 0 Clock Failure Detector Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSCFAIL1</name>
                     <description>XOSC 1 Clock Failure Detector Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRDY</name>
                     <description>DFLL Ready Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLOOB</name>
                     <description>DFLL Out Of Bounds Interrupt Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKF</name>
                     <description>DFLL Lock Fine Interrupt Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKC</name>
                     <description>DFLL Lock Coarse Interrupt Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRCS</name>
                     <description>DFLL Reference Clock Stopped Interrupt Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL0LCKR</name>
                     <description>DPLL0 Lock Rise Interrupt Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL0LCKF</name>
                     <description>DPLL0 Lock Fall Interrupt Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL0LTO</name>
                     <description>DPLL0 Lock Timeout Interrupt Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL0LDRTO</name>
                     <description>DPLL0 Loop Divider Ratio Update Complete Interrupt Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL1LCKR</name>
                     <description>DPLL1 Lock Rise Interrupt Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL1LCKF</name>
                     <description>DPLL1 Lock Fall Interrupt Enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL1LTO</name>
                     <description>DPLL1 Lock Timeout Interrupt Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL1LDRTO</name>
                     <description>DPLL1 Loop Divider Ratio Update Complete Interrupt Enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSCRDY0</name>
                     <description>XOSC 0 Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSCRDY1</name>
                     <description>XOSC 1 Ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSCFAIL0</name>
                     <description>XOSC 0 Clock Failure Detector</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSCFAIL1</name>
                     <description>XOSC 1 Clock Failure Detector</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRDY</name>
                     <description>DFLL Ready</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLOOB</name>
                     <description>DFLL Out Of Bounds</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKF</name>
                     <description>DFLL Lock Fine</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKC</name>
                     <description>DFLL Lock Coarse</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRCS</name>
                     <description>DFLL Reference Clock Stopped</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL0LCKR</name>
                     <description>DPLL0 Lock Rise</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL0LCKF</name>
                     <description>DPLL0 Lock Fall</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL0LTO</name>
                     <description>DPLL0 Lock Timeout</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL0LDRTO</name>
                     <description>DPLL0 Loop Divider Ratio Update Complete</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL1LCKR</name>
                     <description>DPLL1 Lock Rise</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL1LCKF</name>
                     <description>DPLL1 Lock Fall</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL1LTO</name>
                     <description>DPLL1 Lock Timeout</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL1LDRTO</name>
                     <description>DPLL1 Loop Divider Ratio Update Complete</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Status</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XOSCRDY0</name>
                     <description>XOSC 0 Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSCRDY1</name>
                     <description>XOSC 1 Ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSCFAIL0</name>
                     <description>XOSC 0 Clock Failure Detector</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSCFAIL1</name>
                     <description>XOSC 1 Clock Failure Detector</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSCCKSW0</name>
                     <description>XOSC 0 Clock Switch</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XOSCCKSW1</name>
                     <description>XOSC 1 Clock Switch</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRDY</name>
                     <description>DFLL Ready</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLOOB</name>
                     <description>DFLL Out Of Bounds</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKF</name>
                     <description>DFLL Lock Fine</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLLCKC</name>
                     <description>DFLL Lock Coarse</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DFLLRCS</name>
                     <description>DFLL Reference Clock Stopped</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL0LCKR</name>
                     <description>DPLL0 Lock Rise</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL0LCKF</name>
                     <description>DPLL0 Lock Fall</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL0TO</name>
                     <description>DPLL0 Timeout</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL0LDRTO</name>
                     <description>DPLL0 Loop Divider Ratio Update Complete</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL1LCKR</name>
                     <description>DPLL1 Lock Rise</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL1LCKF</name>
                     <description>DPLL1 Lock Fall</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL1TO</name>
                     <description>DPLL1 Timeout</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPLL1LDRTO</name>
                     <description>DPLL1 Loop Divider Ratio Update Complete</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
